lib/tasks/dev.rake

INSERT INTO "mining_types" ("description", "acronym", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "proof os Work"], ["acronym", "poW"], ["created_at", "2022-04-11 20:01:01.281713"], ["updated_at", "2022-04-11 20:01:01.281713"]]
---
  task add_mining_type: :environment do
    show_spinner("Cadastra os tipos de mineração..") do
      mining_types = [
        {description: "proof os Work", acronym: "poW"},
        {description: "proof os Stake", acronym: "poS"},
        {description: "proof os Capacity", acronym: "poC"}
      ]


      mining_types.each do |mining_type|
        MiningType.find_or_create_by!(mining_type)

SELECT "mining_types".* FROM "mining_types" WHERE "mining_types"."description" = ? AND "mining_types"."acronym" = ? LIMIT ?  [["description", "proof os Work"], ["acronym", "poW"], ["LIMIT", 1]]
---
                  mining_type: MiningType.find_by(acronym: 'poW')
                },

                {
                  description: "ZEC",
                  acronym: "DASH",
                  url_image: "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTwXY5GL4nSEQsfAn31xzNL2eU38qagdvy_jg&usqp=CAU",
                  mining_type: MiningType.find_by(acronym: 'poW')
                }
              ]