app/views/mining_types/index.html.erb

SELECT "mining_types".* FROM "mining_types"
SELECT COUNT(*) FROM "mining_types"
---

<h1>"<%= MiningType.model_name.human(count: @mining_types.count) %>"</h1>