app/controllers/coins_controller.rb

  def create
    @coin = Coin.new(coin_params)

    respond_to do |format|
      if @coin.save
---
INSERT INTO "coins" ("description", "acronym", "url_image", "created_at", "updated_at", "mining_type_id") VALUES (?, ?, ?, ?, ?, ?)  [["description", "Bitcoin"], ["acronym", nil], ["url_image", nil], ["created_at", "2022-05-10 19:52:10.348717"], ["updated_at", "2022-05-10 19:52:10.348717"], ["mining_type_id", 1]]

  def update
    respond_to do |format|
      if @coin.update(coin_params)
---
UPDATE "coins" SET "updated_at" = ?, "mining_type_id" = ? WHERE "coins"."id" = ?  [["updated_at", "2022-04-12 15:31:24.718869"], ["mining_type_id", 2], ["id", 1]]